HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_regdef.h
/** \brief PSI5 object */
typedef volatile struct _Ifx_PSI5
{
       Ifx_PSI5_CLC                        CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_PSI5_ID                         ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_PSI5_FDR                        FDR;                    /**< \brief C, PSI5 Fractional Divider Register*/
       Ifx_PSI5_FDRL                       FDRL;                   /**< \brief 10, Fractional Divider Register for Lower Bit Rate*/
       Ifx_PSI5_FDRH                       FDRH;                   /**< \brief 14, Fractional Divider Register for Higher Bit Rate*/
       Ifx_PSI5_FDRT                       FDRT;                   /**< \brief 18, Fractional Divider Register for Time Stamp*/
       Ifx_PSI5_TSRA                       TSRA;                   /**< \brief 1C, Module Time Stamp Register A*/
       Ifx_PSI5_TSRB                       TSRB;                   /**< \brief 20, Time Stamp Register B*/
       Ifx_PSI5_TSRC                       TSRC;                   /**< \brief 24, Module Time Stamp Register C*/
       Ifx_UReg_8Bit                       reserved_28[4];         /**< \brief 28, \internal Reserved */
       Ifx_PSI5_GCR                        GCR;                    /**< \brief 2C, Global Control Register*/
       Ifx_PSI5_CH                         CH[4];                  /**< \brief 30, */
       Ifx_UReg_8Bit                       reserved_270[136];      /**< \brief 270, \internal Reserved */
       Ifx_PSI5_INTOV                      INTOV;                  /**< \brief 2F8, Interrupt Overview Register*/
       Ifx_PSI5_INP                        INP[4];                 /**< \brief 2FC, Interrupt Node Pointer Register ${x}*/
       Ifx_UReg_8Bit                       reserved_30C[4];        /**< \brief 30C, \internal Reserved */
       Ifx_PSI5_INTSTATA                   INTSTATA[4];            /**< \brief 310, Interrupt Status Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_320[4];        /**< \brief 320, \internal Reserved */
       Ifx_PSI5_INTSTATB                   INTSTATB[4];            /**< \brief 324, Interrupt Status Register B ${x}*/
       Ifx_UReg_8Bit                       reserved_334[4];        /**< \brief 334, \internal Reserved */
       Ifx_PSI5_INTSETA                    INTSETA[4];             /**< \brief 338, Interrupt Set Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_348[4];        /**< \brief 348, \internal Reserved */
       Ifx_PSI5_INTSETB                    INTSETB[4];             /**< \brief 34C, Interrupt Set Register B ${x}*/
       Ifx_UReg_8Bit                       reserved_35C[4];        /**< \brief 35C, \internal Reserved */
       Ifx_PSI5_INTCLRA                    INTCLRA[4];             /**< \brief 360, Interrupt Clear Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_370[4];        /**< \brief 370, \internal Reserved */
       Ifx_PSI5_INTCLRB                    INTCLRB[4];             /**< \brief 374, Interrupt Clear Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_384[4];        /**< \brief 384, \internal Reserved */
       Ifx_PSI5_INTENA                     INTENA[4];              /**< \brief 388, Interrupt Enable Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_398[4];        /**< \brief 398, \internal Reserved */
       Ifx_PSI5_INTENB                     INTENB[4];              /**< \brief 39C, Interrupt Enable Register B ${x}*/
       Ifx_UReg_8Bit                       reserved_3AC[32];       /**< \brief 3AC, \internal Reserved */
       Ifx_PSI5_OCS                        OCS;                    /**< \brief 3CC, OCDS Control and Status*/
       Ifx_PSI5_ACCEN0                     ACCEN0;                 /**< \brief 3D0, Access Enable Register 0*/
       Ifx_PSI5_ACCEN1                     ACCEN1;                 /**< \brief 3D4, Access Enable Register 1*/
       Ifx_PSI5_KRST0                      KRST0;                  /**< \brief 3D8, Kernel Reset Register 0*/
       Ifx_PSI5_KRST1                      KRST1;                  /**< \brief 3DC, Kernel Reset Register 1*/
       Ifx_PSI5_KRSTCLR                    KRSTCLR;                /**< \brief 3E0, Kernel Reset Status Clear Register*/
       Ifx_PSI5_RFC                        RFC[4];                 /**< \brief 3E4, Receive FIFO Control Register ${x}*/
       Ifx_UReg_8Bit                       reserved_3F4[4];        /**< \brief 3F4, \internal Reserved */
       Ifx_PSI5_RDF                        RDF[4];                 /**< \brief 3F8, Receive Data FIFO ${x}*/
       Ifx_UReg_8Bit                       reserved_408[4];        /**< \brief 408, \internal Reserved */
       Ifx_PSI5_RSIOV                      RSIOV[4];               /**< \brief 40C, RSI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_41C[4];        /**< \brief 41C, \internal Reserved */
       Ifx_PSI5_RMIOV                      RMIOV[4];               /**< \brief 420, RMI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_430[4];        /**< \brief 430, \internal Reserved */
       Ifx_PSI5_NBIOV                      NBIOV[4];               /**< \brief 434, NBI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_444[4];        /**< \brief 444, \internal Reserved */
       Ifx_PSI5_TEIOV                      TEIOV[4];               /**< \brief 448, TEI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_458[4];        /**< \brief 458, \internal Reserved */
       Ifx_PSI5_CRCIOV                     CRCIOV[4];              /**< \brief 45C, CRCI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_46C[4];        /**< \brief 46C, \internal Reserved */
       Ifx_PSI5_RDIOV                      RDIOV[4];               /**< \brief 470, RDI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_480[4];        /**< \brief 480, \internal Reserved */
       Ifx_PSI5_NFIOV                      NFIOV[4];               /**< \brief 484, NFI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_494[4];        /**< \brief 494, \internal Reserved */
       Ifx_PSI5_MEIOV                      MEIOV[4];               /**< \brief 498, MEI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4A8[4];        /**< \brief 4A8, \internal Reserved */
       Ifx_PSI5_RSISET                     RSISET[4];              /**< \brief 4AC, RSI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4BC[4];        /**< \brief 4BC, \internal Reserved */
       Ifx_PSI5_RMISET                     RMISET[4];              /**< \brief 4C0, RMI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4D0[4];        /**< \brief 4D0, \internal Reserved */
       Ifx_PSI5_NBISET                     NBISET[4];              /**< \brief 4D4, NBI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4E4[4];        /**< \brief 4E4, \internal Reserved */
       Ifx_PSI5_TEISET                     TEISET[4];              /**< \brief 4E8, TEI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4F8[4];        /**< \brief 4F8, \internal Reserved */
       Ifx_PSI5_CRCISET                    CRCISET[4];             /**< \brief 4FC, CRCI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_50C[4];        /**< \brief 50C, \internal Reserved */
       Ifx_PSI5_RDISET                     RDISET[4];              /**< \brief 510, RDI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_520[4];        /**< \brief 520, \internal Reserved */
       Ifx_PSI5_NFISET                     NFISET[4];              /**< \brief 524, NFI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_534[4];        /**< \brief 534, \internal Reserved */
       Ifx_PSI5_MEISET                     MEISET[4];              /**< \brief 538, MEI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_548[4];        /**< \brief 548, \internal Reserved */
       Ifx_PSI5_RSICLR                     RSICLR[4];              /**< \brief 54C, RSI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_55C[4];        /**< \brief 55C, \internal Reserved */
       Ifx_PSI5_RMICLR                     RMICLR[4];              /**< \brief 560, RMI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_570[4];        /**< \brief 570, \internal Reserved */
       Ifx_PSI5_NBICLR                     NBICLR[4];              /**< \brief 574, NBI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_584[4];        /**< \brief 584, \internal Reserved */
       Ifx_PSI5_TEICLR                     TEICLR[4];              /**< \brief 588, TEI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_598[4];        /**< \brief 598, \internal Reserved */
       Ifx_PSI5_CRCICLR                    CRCICLR[4];             /**< \brief 59C, CRCI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5AC[4];        /**< \brief 5AC, \internal Reserved */
       Ifx_PSI5_RDICLR                     RDICLR[4];              /**< \brief 5B0, RDI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5C0[4];        /**< \brief 5C0, \internal Reserved */
       Ifx_PSI5_NFICLR                     NFICLR[4];              /**< \brief 5C4, NFI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5D4[4];        /**< \brief 5D4, \internal Reserved */
       Ifx_PSI5_MEICLR                     MEICLR[4];              /**< \brief 5D8, MEI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5E8[24];       /**< \brief 5E8, \internal Reserved */
       Ifx_PSI5_RDM                        RDM[4][32];             /**< \brief 600, */
       Ifx_UReg_8Bit                       reserved_A00[256];      /**< \brief A00, \internal Reserved */
} Ifx_PSI5;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXPSI5_REGDEF_H */
